import pandas as pd

data = [
    {"نمبر شمار": 17, "نام دکان": "ممتاز ہئیر ڈریسنگ سیلون", "دکاندار کا نام": "طارق", "فون نمبر": "0307-6983014", "شناختی کارڈ نمبر": "31102-7613543-9", "تعداد ڈیٹ": 5},
    {"نمبر شمار": 18, "نام دکان": "شبیر حسین ٹیچی ٹیلر", "دکاندار کا نام": "فراز", "فون نمبر": "0302-7409284", "شناختی کارڈ نمبر": "31102-0573947-9", "تعداد ڈیٹ": 5},
    {"نمبر شمار": 19, "نام دکان": "محبوب الرحمن سٹور", "دکاندار کا نام": "بشیر احمد", "فون نمبر": "0303-7112795", "شناختی کارڈ نمبر": "31102-1686858-9", "تعداد ڈیٹ": 1},
    {"نمبر شمار": 20, "نام دکان": "عدنان کلاتھ اینڈ ٹیلرنگ سٹور", "دکاندار کا نام": "عدنان علی", "فون نمبر": "0300-7549470", "شناختی کارڈ نمبر": "31102-9920951-1", "تعداد ڈیٹ": 5},
    {"نمبر شمار": 21, "نام دکان": "انٹر نیشنل کریانہ سٹور", "دکاندار کا نام": "ممتاز احمد", "فون نمبر": "0302-4268508", "شناختی کارڈ نمبر": "31102-5672982-5", "تعداد ڈیٹ": 3},
    {"نمبر شمار": 22, "نام دکان": "مرسڈیز ہئیر ڈریسنگ سیلون", "دکاندار کا نام": "حاجی محمد خلیل", "فون نمبر": "0301-5026914", "شناختی کارڈ نمبر": "31102-9350686-3", "تعداد ڈیٹ": 1},
    {"نمبر شمار": 23, "نام دکان": "زاہد برادرز جنرل سٹور", "دکاندار کا نام": "زاہد", "فون نمبر": "0300-0871442", "شناختی کارڈ نمبر": "31102-9250072-3", "تعداد ڈیٹ": 1},
    {"نمبر شمار": 24, "نام دکان": "عمران الیکٹرک اینڈ ٹیلرنگ سٹور", "دکاندار کا نام": "عمران ستار", "فون نمبر": "0306-0731103", "شناختی کارڈ نمبر": "31101-0639953-1", "تعداد ڈیٹ": 5},
    {"نمبر شمار": 25, "نام دکان": "ماشااللہ الیکٹرک اینڈ ریفریجریٹر", "دکاندار کا نام": "احسن رحمان", "فون نمبر": "0307-4828564", "شناختی کارڈ نمبر": "31101-4621040-1", "تعداد ڈیٹ": 1},
    {"نمبر شمار": 26, "نام دکان": "رانا محمد اقبال کریانہ سٹور", "دکاندار کا نام": "محمد اقبال", "فون نمبر": "0301-7913177", "شناختی کارڈ نمبر": "31101-7660746-7", "تعداد ڈیٹ": 3},
    {"نمبر شمار": 27, "نام دکان": "عمران فینسی کلاتھ سٹور", "دکاندار کا نام": "عمران غنی", "فون نمبر": "0303-6900734", "شناختی کارڈ نمبر": "31101-7745475-5", "تعداد ڈیٹ": 6},
    {"نمبر شمار": 28, "نام دکان": "علی الیکٹرک اینڈ ہئیر ڈریسنگ", "دکاندار کا نام": "محمد علی ہاشمی", "فون نمبر": "0303-9958713", "شناختی کارڈ نمبر": "31101-6158821-3", "تعداد ڈیٹ": 6},
    {"نمبر شمار": 29, "نام دکان": "چوہدری ظفر کریانہ سٹور", "دکاندار کا نام": "چوہدری ظفر", "فون نمبر": "0301-4052003", "شناختی کارڈ نمبر": "31101-2698596-1", "تعداد ڈیٹ": 1},
    {"نمبر شمار": 30, "نام دکان": "کرامت کریانہ سٹور", "دکاندار کا نام": "کرامت", "فون نمبر": "0334-7275945", "شناختی کارڈ نمبر": "31101-1611705-9", "تعداد ڈیٹ": 5},
    {"نمبر شمار": 31, "نام دکان": "چوہدری اعجاز کریانہ سٹور", "دکاندار کا نام": "اعجاز", "فون نمبر": "0305-9207523", "شناختی کارڈ نمبر": "31101-7028127-7", "تعداد ڈیٹ": 5},
    {"نمبر شمار": 32, "نام دکان": "شاہ زیب جنرل سٹور", "دکاندار کا نام": "شاہ زیب", "فون نمبر": "0300-6982002", "شناختی کارڈ نمبر": "31101-4464268-9", "تعداد ڈیٹ": 5}
]

df = pd.DataFrame(data)
output_file = 'Handwritten_Urdu_Data.xlsx'
df.to_excel(output_file, index=False)

print(f"Data saved to {output_file}")